99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/i2s/esp32_mquickjs_i2s.c
#include "esp32_mquickjs_i2s.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_I2S

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_peripheral_lease.h"
#include "utils/esp32_mquickjs_byte_source.h"

#include <math.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "driver/gpio.h"
#include "driver/i2s_common.h"
#if SOC_I2S_SUPPORTS_PDM_RX
#include "driver/i2s_pdm.h"
#endif
#include "driver/i2s_std.h"
#include "esp_attr.h"
#include "esp_err.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "hal/i2s_ll.h"
#include "soc/soc_caps.h"

#define I2S_MAX_READ_BYTES (64U * 1024U)
#define I2S_MAX_WRITE_BYTES (64U * 1024U)
#define I2S_DMA_MAX_DESCRIPTOR_BYTES 4092U
#define I2S_DEFAULT_SAMPLE_RATE_HZ 16000U
#define I2S_DEFAULT_TIMEOUT_MS 1000U
#define I2S_DEFAULT_DMA_DESCRIPTORS 6U
#define I2S_DEFAULT_DMA_FRAMES 240U

typedef enum {
    ESP32_MQUICKJS_I2S_MODE_STANDARD,
    ESP32_MQUICKJS_I2S_MODE_PDM,
} esp32_mquickjs_i2s_mode_t;

typedef enum {
    ESP32_MQUICKJS_I2S_DIRECTION_RX = 1,
    ESP32_MQUICKJS_I2S_DIRECTION_TX = 2,
    ESP32_MQUICKJS_I2S_DIRECTION_DUPLEX = 3,
} esp32_mquickjs_i2s_direction_t;

typedef struct {
    int32_t port;
    uint32_t generation;
} esp32_mquickjs_i2s_ref_t;

typedef struct {
    bool allocated;
    bool running;
    bool rx_busy;
    bool tx_busy;
    bool rx_cancel_requested;
    bool tx_cancel_requested;
    bool release_pending;
    int32_t port;
    uint32_t generation;
    esp32_mquickjs_i2s_mode_t mode;
    esp32_mquickjs_i2s_direction_t direction;
    uint32_t sample_rate_hz;
    uint8_t data_bits;
    uint8_t slot_bits;
    uint8_t channels;
    uint32_t dma_descriptor_count;
    uint32_t dma_frames_per_descriptor;
    uint32_t timeout_ms;
    volatile uint32_t overruns;
    volatile uint32_t underruns;
    uint32_t sequence;
    i2s_chan_handle_t rx_handle;
    i2s_chan_handle_t tx_handle;
    esp32_mquickjs_runtime_t *rx_runtime;
    esp32_mquickjs_runtime_t *tx_runtime;
    esp32_mquickjs_future_token_t rx_token;
    esp32_mquickjs_future_token_t tx_token;
    esp32_mquickjs_peripheral_lease_t lease;
} esp32_mquickjs_i2s_slot_t;

static esp32_mquickjs_i2s_slot_t s_i2s_slots[I2S_LL_GET(INST_NUM)];
static uint32_t s_i2s_next_generation = 1;

struct esp32_mquickjs_future_driver_state {
    JSContext *ctx;
    JSGCRef owner_ref;
    esp32_mquickjs_i2s_ref_t channel_ref;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    esp_timer_handle_t timeout_timer;
    uint8_t *data;
    size_t requested_bytes;
    size_t transferred_bytes;
    uint32_t frame_count;
    uint32_t timeout_ms;
    uint64_t deadline_us;
    esp_err_t err;
    bool owner_retained;
    bool started;
    bool completed;
    bool cancelled;
    bool timed_out;
};

static bool i2s_has_rx(const esp32_mquickjs_i2s_slot_t *slot)
{
    return slot != NULL &&
           (slot->direction & ESP32_MQUICKJS_I2S_DIRECTION_RX) != 0;
}

static bool i2s_has_tx(const esp32_mquickjs_i2s_slot_t *slot)
{
    return slot != NULL &&
           (slot->direction & ESP32_MQUICKJS_I2S_DIRECTION_TX) != 0;
}

static bool i2s_slot_busy(const esp32_mquickjs_i2s_slot_t *slot)
{
    return slot != NULL && (slot->rx_busy || slot->tx_busy);
}

static uint32_t i2s_take_generation(void)
{
    uint32_t generation = s_i2s_next_generation++;

    if (generation == 0) {
        generation = s_i2s_next_generation++;
    }
    return generation;
}

static bool i2s_to_u32(JSContext *ctx, JSValue value, uint32_t *out)
{
    double number;
    uint32_t converted;

    if (!JS_IsNumber(ctx, value) ||
        JS_ToNumber(ctx, &number, value) != 0 || !isfinite(number) ||
        number < 0 || number > INT32_MAX) {
        return false;
    }
    converted = (uint32_t)number;
    if ((double)converted != number) {
        return false;
    }
    *out = converted;
    return true;
}

static bool i2s_to_gpio(JSContext *ctx, JSValue value, bool output, int *out)
{
    uint32_t raw;
    int pin;

    if (!i2s_to_u32(ctx, value, &raw) || raw >= GPIO_NUM_MAX) {
        return false;
    }
    pin = (int)raw;
    if (output ? !GPIO_IS_VALID_OUTPUT_GPIO(pin) : !GPIO_IS_VALID_GPIO(pin)) {
        return false;
    }
    *out = pin;
    return true;
}

static bool i2s_string_equals(JSContext *ctx, JSValue value, const char *expected)
{
    JSCStringBuf buffer;
    const char *text;

    if (!JS_IsString(ctx, value)) {
        return false;
    }
    text = JS_ToCString(ctx, value, &buffer);
    return text != NULL && strcmp(text, expected) == 0;
}

static esp32_mquickjs_i2s_slot_t *i2s_get_slot(
    const esp32_mquickjs_i2s_ref_t *ref)
{
    esp32_mquickjs_i2s_slot_t *slot;

    if (ref == NULL || ref->port < 0 ||
        ref->port >= I2S_LL_GET(INST_NUM)) {
        return NULL;
    }
    slot = &s_i2s_slots[ref->port];
    if (!slot->allocated || slot->generation != ref->generation) {
        return NULL;
    }
    return slot;
}

static void i2s_cleanup_slot(esp32_mquickjs_i2s_slot_t *slot)
{
    int32_t port;

    if (slot == NULL || !slot->allocated || i2s_slot_busy(slot)) {
        return;
    }
    port = slot->port;
    if (slot->running) {
        if (slot->rx_handle != NULL) {
            (void)i2s_channel_disable(slot->rx_handle);
        }
        if (slot->tx_handle != NULL) {
            (void)i2s_channel_disable(slot->tx_handle);
        }
    }
    if (slot->rx_handle != NULL) {
        (void)i2s_del_channel(slot->rx_handle);
    }
    if (slot->tx_handle != NULL) {
        (void)i2s_del_channel(slot->tx_handle);
    }
    esp32_mquickjs_peripheral_lease_release(&slot->lease);
    memset(slot, 0, sizeof(*slot));
    slot->port = port;
}

static void i2s_request_close(esp32_mquickjs_i2s_slot_t *slot)
{
    if (slot == NULL || !slot->allocated) {
        return;
    }
    slot->release_pending = true;
    if (slot->rx_busy) {
        slot->rx_cancel_requested = true;
        if (slot->rx_runtime != NULL) {
            (void)esp32_mquickjs_future_wake(slot->rx_runtime,
                                             slot->rx_token);
        }
    }
    if (slot->tx_busy) {
        slot->tx_cancel_requested = true;
        if (slot->tx_runtime != NULL) {
            (void)esp32_mquickjs_future_wake(slot->tx_runtime,
                                             slot->tx_token);
        }
    }
    if (!i2s_slot_busy(slot)) {
        i2s_cleanup_slot(slot);
    }
}

