99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/i2s/esp32_mquickjs_i2s.c
static int i2s_ref_from_value(JSContext *ctx, JSValue value,
                              const char *api_name,
                              esp32_mquickjs_i2s_ref_t *out_ref,
                              esp32_mquickjs_i2s_slot_t **out_slot)
{
    esp32_mquickjs_i2s_ref_t *ref;
    esp32_mquickjs_i2s_slot_t *slot;

    if (JS_GetClassID(ctx, value) != JS_CLASS_I2S_CHANNEL ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "%s expects an I2SChannel", api_name);
        return -1;
    }
    slot = i2s_get_slot(ref);
    if (slot == NULL) {
        JS_ThrowReferenceError(ctx, "%s failed because the I2S channel is closed",
                               api_name);
        return -1;
    }
    if (out_ref != NULL) {
        *out_ref = *ref;
    }
    if (out_slot != NULL) {
        *out_slot = slot;
    }
    return 0;
}

static JSValue i2s_make_channel(JSContext *ctx,
                              const esp32_mquickjs_i2s_slot_t *slot)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    esp32_mquickjs_i2s_ref_t *ref;

    *object = JS_NewObjectClassUser(ctx, JS_CLASS_I2S_CHANNEL);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    ref = heap_caps_malloc(sizeof(*ref), MALLOC_CAP_8BIT);
    if (ref == NULL) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_ThrowOutOfMemory(ctx);
    }
    ref->port = slot->port;
    ref->generation = slot->generation;
    JS_SetOpaque(ctx, *object, ref);
    return JS_PopGCRef(ctx, &object_ref);
}

static bool IRAM_ATTR i2s_on_receive(i2s_chan_handle_t handle,
                                     i2s_event_data_t *event,
                                     void *user_ctx)
{
    esp32_mquickjs_i2s_slot_t *slot = user_ctx;
    int task_woken = pdFALSE;

    (void)handle;
    (void)event;
    if (slot != NULL && slot->rx_busy && slot->rx_runtime != NULL) {
        (void)esp32_mquickjs_future_wake_from_isr(slot->rx_runtime,
                                                 slot->rx_token,
                                                 &task_woken);
    }
    return task_woken == pdTRUE;
}

static bool IRAM_ATTR i2s_on_overflow(i2s_chan_handle_t handle,
                                      i2s_event_data_t *event,
                                      void *user_ctx)
{
    esp32_mquickjs_i2s_slot_t *slot = user_ctx;
    int task_woken = pdFALSE;

    (void)handle;
    (void)event;
    if (slot != NULL) {
        slot->overruns++;
        if (slot->rx_busy && slot->rx_runtime != NULL) {
            (void)esp32_mquickjs_future_wake_from_isr(
                slot->rx_runtime, slot->rx_token, &task_woken);
        }
    }
    return task_woken == pdTRUE;
}

static bool IRAM_ATTR i2s_on_sent(i2s_chan_handle_t handle,
                                  i2s_event_data_t *event,
                                  void *user_ctx)
{
    esp32_mquickjs_i2s_slot_t *slot = user_ctx;
    int task_woken = pdFALSE;

    (void)handle;
    (void)event;
    if (slot != NULL && slot->tx_busy && slot->tx_runtime != NULL) {
        (void)esp32_mquickjs_future_wake_from_isr(slot->tx_runtime,
                                                 slot->tx_token,
                                                 &task_woken);
    }
    return task_woken == pdTRUE;
}

static bool IRAM_ATTR i2s_on_send_overflow(i2s_chan_handle_t handle,
                                           i2s_event_data_t *event,
                                           void *user_ctx)
{
    esp32_mquickjs_i2s_slot_t *slot = user_ctx;
    int task_woken = pdFALSE;

    (void)handle;
    (void)event;
    if (slot != NULL) {
        slot->underruns++;
        if (slot->tx_busy && slot->tx_runtime != NULL) {
            (void)esp32_mquickjs_future_wake_from_isr(
                slot->tx_runtime, slot->tx_token, &task_woken);
        }
    }
    return task_woken == pdTRUE;
}

static JSValue i2s_status_object(JSContext *ctx,
                                 const esp32_mquickjs_i2s_slot_t *slot)
{
    JSGCRef result_ref;
    JSGCRef pcm_ref;
    JSGCRef dma_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *pcm = JS_PushGCRef(ctx, &pcm_ref);
    JSValue *dma = JS_PushGCRef(ctx, &dma_ref);

    *result = JS_NewObject(ctx);
    *pcm = JS_NewObject(ctx);
    *dma = JS_NewObject(ctx);
    if (JS_IsException(*result) || JS_IsException(*pcm) ||
        JS_IsException(*dma) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "port",
                                         JS_NewInt32(ctx, slot->port)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "running",
                                         JS_NewBool(slot->running)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "direction",
            JS_NewString(
                ctx,
                slot->direction == ESP32_MQUICKJS_I2S_DIRECTION_DUPLEX
                    ? "duplex"
                    : slot->direction == ESP32_MQUICKJS_I2S_DIRECTION_TX
                          ? "tx"
                          : "rx")) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "mode",
            JS_NewString(ctx, slot->mode == ESP32_MQUICKJS_I2S_MODE_PDM
                                  ? "pdm" : "standard")) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "overruns",
                                         JS_NewUint32(ctx, slot->overruns)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "underruns",
                                         JS_NewUint32(ctx, slot->underruns)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "readBusy",
                                         JS_NewBool(slot->rx_busy)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "writeBusy",
                                         JS_NewBool(slot->tx_busy)) ||
        !esp32_mquickjs_set_property_ref(ctx, pcm, "sampleRateHz",
                                         JS_NewUint32(ctx, slot->sample_rate_hz)) ||
        !esp32_mquickjs_set_property_ref(ctx, pcm, "dataBits",
                                         JS_NewInt32(ctx, slot->data_bits)) ||
        !esp32_mquickjs_set_property_ref(ctx, pcm, "slotBits",
                                         JS_NewInt32(ctx, slot->slot_bits)) ||
        !esp32_mquickjs_set_property_ref(ctx, pcm, "channels",
                                         JS_NewInt32(ctx, slot->channels)) ||
        !esp32_mquickjs_set_property_ref(ctx, pcm, "signed",
                                         JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, pcm, "endianness",
                                         JS_NewString(ctx, "little")) ||
        !esp32_mquickjs_set_property_ref(
            ctx, dma, "descriptorCount",
            JS_NewUint32(ctx, slot->dma_descriptor_count)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, dma, "framesPerDescriptor",
            JS_NewUint32(ctx, slot->dma_frames_per_descriptor)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "pcm", *pcm) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "dma", *dma)) {
        JS_PopGCRef(ctx, &dma_ref);
        JS_PopGCRef(ctx, &pcm_ref);
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    *pcm = JS_UNDEFINED;
    *dma = JS_UNDEFINED;
    JS_PopGCRef(ctx, &dma_ref);
    JS_PopGCRef(ctx, &pcm_ref);
    return JS_PopGCRef(ctx, &result_ref);
}

static void i2s_timeout_timer(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;

    if (state != NULL && !state->completed && state->runtime != NULL) {
        (void)esp32_mquickjs_future_wake(state->runtime, state->token);
    }
}

static bool i2s_read_prepare(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    esp32_mquickjs_i2s_slot_t *slot;
    uint32_t frame_count;
    uint32_t timeout_ms;
    size_t bytes_per_frame;
    JSValue *owner;

    if (out_state == NULL || argc < 1 || argc > 2 ||
        !i2s_to_u32(ctx, argv[0].val, &frame_count) || frame_count == 0) {
        JS_ThrowTypeError(ctx,
                          "I2SChannel.read(frameCount, timeoutMs?) expects a positive frame count");
        return false;
    }
    if (i2s_ref_from_value(ctx, this_ref->val, "I2SChannel.read()", NULL,
                           &slot) != 0) {
        return false;
    }
    timeout_ms = slot->timeout_ms;
    if (argc == 2 && !JS_IsUndefined(argv[1].val) &&
        !i2s_to_u32(ctx, argv[1].val, &timeout_ms)) {
        JS_ThrowTypeError(ctx,
                          "I2SChannel.read(frameCount, timeoutMs?) expects a non-negative timeout");
        return false;
    }
    if (!i2s_has_rx(slot)) {
        JS_ThrowTypeError(ctx,
                          "I2SChannel.read() requires an rx or duplex channel");
        return false;
    }
    if (!slot->running) {
        JS_ThrowInternalError(ctx, "I2SChannel.read() requires start() first");
        return false;
    }
    if (slot->rx_busy) {
        JS_ThrowInternalError(ctx, "I2S channel already has a pending read");
        return false;
    }
    bytes_per_frame = ((size_t)slot->slot_bits / 8U) * slot->channels;
    if (frame_count > I2S_MAX_READ_BYTES / bytes_per_frame) {
        JS_ThrowRangeError(ctx,
                           "I2SChannel.read() output exceeds the 64 KiB limit");
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->data = heap_caps_malloc((size_t)frame_count * bytes_per_frame,
                                   MALLOC_CAP_8BIT);
    if (state->data == NULL) {
        heap_caps_free(state);
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->channel_ref.port = slot->port;
    state->channel_ref.generation = slot->generation;
    state->requested_bytes = (size_t)frame_count * bytes_per_frame;
    state->frame_count = frame_count;
    state->timeout_ms = timeout_ms;
    owner = JS_AddGCRef(ctx, &state->owner_ref);
    *owner = this_ref->val;
    state->owner_retained = true;
    *out_state = state;
    return true;
}

