99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/i2s/esp32_mquickjs_i2s.c
static void i2s_read_step(esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_i2s_slot_t *slot =
        state != NULL ? i2s_get_slot(&state->channel_ref) : NULL;
    size_t read_bytes = 0;

    if (state == NULL || state->completed || state->cancelled) {
        return;
    }
    if (slot != NULL && slot->rx_cancel_requested) {
        state->cancelled = true;
        state->completed = true;
        return;
    }
    if (slot == NULL || !slot->running) {
        state->err = ESP_ERR_INVALID_STATE;
        state->completed = true;
        return;
    }
    state->err = i2s_channel_read(
        slot->rx_handle, state->data + state->transferred_bytes,
        state->requested_bytes - state->transferred_bytes, &read_bytes, 0);
    /*
     * ESP-IDF reports ESP_ERR_TIMEOUT when a zero-wait read consumes the
     * currently available DMA bytes but cannot fill the complete request.
     * Those partial bytes are valid and must be retained for the next wake;
     * dropping them makes reads larger than one DMA descriptor eventually
     * time out while continuously draining the driver's queue.
     */
    if (state->err == ESP_OK || state->err == ESP_ERR_TIMEOUT) {
        state->transferred_bytes += read_bytes;
        if (state->transferred_bytes >= state->requested_bytes) {
            state->err = ESP_OK;
            state->completed = true;
            return;
        }
        if (state->err == ESP_ERR_TIMEOUT) {
            state->err = ESP_OK;
        }
    } else {
        state->completed = true;
        return;
    }
    if (state->timeout_ms == 0 ||
        (state->deadline_us > 0 &&
         (uint64_t)esp_timer_get_time() >= state->deadline_us)) {
        state->timed_out = state->transferred_bytes == 0;
        state->completed = true;
    }
}

static bool i2s_read_start(JSContext *ctx,
                           esp32_mquickjs_runtime_t *runtime,
                           esp32_mquickjs_future_token_t token,
                           esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_i2s_slot_t *slot =
        state != NULL ? i2s_get_slot(&state->channel_ref) : NULL;

    if (state == NULL || slot == NULL || !slot->running) {
        JS_ThrowReferenceError(ctx, "I2S channel closed before read started");
        return false;
    }
    if (slot->rx_busy) {
        JS_ThrowInternalError(ctx, "I2S channel already has a pending read");
        return false;
    }
    slot->rx_busy = true;
    slot->rx_cancel_requested = false;
    slot->rx_runtime = runtime;
    slot->rx_token = token;
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (state->timeout_ms > 0) {
        esp_timer_create_args_t args = {
            .callback = i2s_timeout_timer,
            .arg = state,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "mqjs_i2s",
            .skip_unhandled_events = true,
        };

        state->deadline_us = (uint64_t)esp_timer_get_time() +
                             (uint64_t)state->timeout_ms * 1000ULL;
        if (esp_timer_create(&args, &state->timeout_timer) != ESP_OK ||
            esp_timer_start_once(state->timeout_timer,
                                 (uint64_t)state->timeout_ms * 1000ULL) !=
                ESP_OK) {
            JS_ThrowInternalError(ctx, "failed to start I2S read timeout");
            return false;
        }
    }
    i2s_read_step(state);
    (void)esp32_mquickjs_future_wake(runtime, token);
    return true;
}

static esp32_mquickjs_future_poll_t i2s_read_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    i2s_read_step(state);
    return state != NULL && state->completed
               ? ESP32_MQUICKJS_FUTURE_READY
               : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue i2s_read_finish(JSContext *ctx,
                               esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_i2s_slot_t *slot =
        state != NULL ? i2s_get_slot(&state->channel_ref) : NULL;
    JSGCRef result_ref;
    JSGCRef data_ref;
    JSValue *result;
    JSValue *data;
    size_t bytes_per_frame;
    uint32_t frames;

    if (state == NULL || state->cancelled) {
        return JS_ThrowInternalError(ctx, "I2S read cancelled");
    }
    if (state->err != ESP_OK) {
        return JS_ThrowInternalError(ctx, "I2SChannel.read() failed: %s",
                                     esp_err_to_name(state->err));
    }
    if (state->timed_out || state->transferred_bytes == 0) {
        return JS_NULL;
    }
    if (slot == NULL) {
        return JS_ThrowReferenceError(ctx, "I2S channel closed during read");
    }
    bytes_per_frame = ((size_t)slot->slot_bits / 8U) * slot->channels;
    frames = (uint32_t)(state->transferred_bytes / bytes_per_frame);
    state->transferred_bytes = (size_t)frames * bytes_per_frame;
    result = JS_PushGCRef(ctx, &result_ref);
    data = JS_PushGCRef(ctx, &data_ref);
    *result = JS_NewObject(ctx);
    *data = JS_IsException(*result)
                ? JS_EXCEPTION
                : esp32_mquickjs_new_owned_byte_view(
                      ctx, state->data, state->transferred_bytes);
    if (!JS_IsException(*data)) {
        state->data = NULL;
    }
    if (JS_IsException(*result) || JS_IsException(*data) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "data", *data) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "frames",
                                         JS_NewUint32(ctx, frames)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "byteLength",
            JS_NewInt64(ctx, (int64_t)state->transferred_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "timestampUs",
            JS_NewInt64(ctx, (int64_t)esp_timer_get_time())) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "sequence", JS_NewUint32(ctx, slot->sequence++)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "overruns", JS_NewUint32(ctx, slot->overruns))) {
        JS_PopGCRef(ctx, &data_ref);
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    *data = JS_UNDEFINED;
    JS_PopGCRef(ctx, &data_ref);
    return JS_PopGCRef(ctx, &result_ref);
}

static bool i2s_read_cancel(esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->completed || state->cancelled) {
        return false;
    }
    state->cancelled = true;
    state->completed = true;
    if (state->runtime != NULL) {
        (void)esp32_mquickjs_future_wake(state->runtime, state->token);
    }
    return true;
}

