99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/i2s/esp32_mquickjs_i2s.c
static void i2s_read_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_i2s_slot_t *slot =
        state != NULL ? i2s_get_slot(&state->channel_ref) : NULL;

    if (state == NULL) {
        return;
    }
    if (state->timeout_timer != NULL) {
        (void)esp_timer_stop(state->timeout_timer);
        (void)esp_timer_delete(state->timeout_timer);
    }
    if (slot != NULL && state->started) {
        slot->rx_busy = false;
        slot->rx_cancel_requested = false;
        slot->rx_runtime = NULL;
        if (slot->release_pending) {
            i2s_cleanup_slot(slot);
        }
    }
    if (state->owner_retained) {
        JS_DeleteGCRef(state->ctx, &state->owner_ref);
    }
    heap_caps_free(state->data);
    heap_caps_free(state);
}

static const esp32_mquickjs_future_driver_t s_i2s_read_driver = {
    .prepare = i2s_read_prepare,
    .start = i2s_read_start,
    .poll = i2s_read_poll,
    .finish = i2s_read_finish,
    .cancel = i2s_read_cancel,
    .destroy = i2s_read_destroy,
};

static bool i2s_append_write_bytes(JSContext *ctx, uint8_t **buffer,
                                   size_t *length, size_t *capacity,
                                   const uint8_t *data, size_t data_length)
{
    size_t required;
    size_t next_capacity;
    uint8_t *next;

    if (data_length == 0) {
        return true;
    }
    if (data == NULL || *length > I2S_MAX_WRITE_BYTES - data_length) {
        JS_ThrowRangeError(ctx,
                           "I2SChannel.write() exceeds the 64 KiB limit");
        return false;
    }
    required = *length + data_length;
    if (required > *capacity) {
        next_capacity = *capacity == 0 ? 256U : *capacity;
        while (next_capacity < required) {
            if (next_capacity >= I2S_MAX_WRITE_BYTES / 2U) {
                next_capacity = I2S_MAX_WRITE_BYTES;
                break;
            }
            next_capacity *= 2U;
        }
        next = heap_caps_realloc(*buffer, next_capacity, MALLOC_CAP_8BIT);
        if (next == NULL) {
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
        *buffer = next;
        *capacity = next_capacity;
    }
    memcpy(*buffer + *length, data, data_length);
    *length = required;
    return true;
}

static bool i2s_load_write_data(JSContext *ctx, JSValue value,
                                uint8_t **out_data, size_t *out_length)
{
    int class_id = JS_GetClassID(ctx, value);
    uint8_t *data = NULL;
    size_t length = 0;
    size_t capacity = 0;

    if (class_id == JS_CLASS_BYTE_SPAN_SOURCE ||
        class_id == JS_CLASS_BITMAP_SPAN_SOURCE) {
        esp32_mquickjs_byte_span_source_t source;
        JSValue error = JS_UNDEFINED;

        if (!esp32_mquickjs_open_byte_span_source(
                ctx, value, "I2SChannel.write(data)", &source, &error)) {
            return false;
        }
        while (true) {
            esp32_mquickjs_byte_span_t span;

            if (!esp32_mquickjs_byte_span_source_next(ctx, &source, &span)) {
                if (JS_HasException(ctx)) {
                    esp32_mquickjs_byte_span_source_close(ctx, &source);
                    heap_caps_free(data);
                    return false;
                }
                break;
            }
            if (!i2s_append_write_bytes(ctx, &data, &length, &capacity,
                                        span.data, span.length)) {
                esp32_mquickjs_byte_span_source_close(ctx, &source);
                heap_caps_free(data);
                return false;
            }
        }
        esp32_mquickjs_byte_span_source_close(ctx, &source);
    } else {
        esp32_mquickjs_byte_source_t source;
        uint8_t *owned = NULL;
        JSValue error = JS_UNDEFINED;

        if (!esp32_mquickjs_get_byte_source(
                ctx, value, "I2SChannel.write(data)", &source, &owned,
                &error)) {
            return false;
        }
        if (!i2s_append_write_bytes(ctx, &data, &length, &capacity,
                                    source.data, source.length)) {
            esp32_mquickjs_release_byte_source(owned);
            heap_caps_free(data);
            return false;
        }
        esp32_mquickjs_release_byte_source(owned);
    }
    *out_data = data;
    *out_length = length;
    return true;
}

static bool i2s_write_prepare(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_i2s_slot_t *slot;
    esp32_mquickjs_future_driver_state_t *state;
    uint32_t timeout_ms;
    size_t bytes_per_frame;
    JSValue *owner;

    if (out_state == NULL || argc < 1 || argc > 2) {
        JS_ThrowTypeError(
            ctx,
            "I2SChannel.write(data, timeoutMs?) expects a ByteSource or ByteSpanSource");
        return false;
    }
    if (i2s_ref_from_value(ctx, this_ref->val, "I2SChannel.write()", NULL,
                           &slot) != 0) {
        return false;
    }
    if (!i2s_has_tx(slot)) {
        JS_ThrowTypeError(ctx,
                          "I2SChannel.write() requires a tx or duplex channel");
        return false;
    }
    if (!slot->running) {
        JS_ThrowInternalError(ctx, "I2SChannel.write() requires start() first");
        return false;
    }
    if (slot->tx_busy) {
        JS_ThrowInternalError(ctx, "I2S channel already has a pending write");
        return false;
    }
    timeout_ms = slot->timeout_ms;
    if (argc == 2 && !JS_IsUndefined(argv[1].val) &&
        !i2s_to_u32(ctx, argv[1].val, &timeout_ms)) {
        JS_ThrowTypeError(
            ctx,
            "I2SChannel.write(data, timeoutMs?) expects a non-negative timeout");
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    if (!i2s_load_write_data(ctx, argv[0].val, &state->data,
                             &state->requested_bytes)) {
        heap_caps_free(state);
        return false;
    }
    bytes_per_frame = ((size_t)slot->slot_bits / 8U) * slot->channels;
    if (state->requested_bytes % bytes_per_frame != 0) {
        heap_caps_free(state->data);
        heap_caps_free(state);
        JS_ThrowRangeError(
            ctx, "I2SChannel.write() byte length must align to a PCM frame");
        return false;
    }
    state->ctx = ctx;
    state->channel_ref.port = slot->port;
    state->channel_ref.generation = slot->generation;
    state->frame_count =
        (uint32_t)(state->requested_bytes / bytes_per_frame);
    state->timeout_ms = timeout_ms;
    owner = JS_AddGCRef(ctx, &state->owner_ref);
    *owner = this_ref->val;
    state->owner_retained = true;
    *out_state = state;
    return true;
}

