99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/i2s/esp32_mquickjs_i2s.c
static void i2s_write_step(esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_i2s_slot_t *slot =
        state != NULL ? i2s_get_slot(&state->channel_ref) : NULL;
    size_t written_bytes = 0;

    if (state == NULL || state->completed || state->cancelled) {
        return;
    }
    if (slot != NULL && slot->tx_cancel_requested) {
        state->cancelled = true;
        state->completed = true;
        return;
    }
    if (slot == NULL || !slot->running) {
        state->err = ESP_ERR_INVALID_STATE;
        state->completed = true;
        return;
    }
    if (state->requested_bytes == 0) {
        state->err = ESP_OK;
        state->completed = true;
        return;
    }
    state->err = i2s_channel_write(
        slot->tx_handle, state->data + state->transferred_bytes,
        state->requested_bytes - state->transferred_bytes, &written_bytes, 0);
    if (state->err == ESP_OK || state->err == ESP_ERR_TIMEOUT) {
        state->transferred_bytes += written_bytes;
        if (state->transferred_bytes >= state->requested_bytes) {
            state->err = ESP_OK;
            state->completed = true;
            return;
        }
        if (state->err == ESP_ERR_TIMEOUT) {
            state->err = ESP_OK;
        }
    } else {
        state->completed = true;
        return;
    }
    if (state->timeout_ms == 0 ||
        (state->deadline_us > 0 &&
         (uint64_t)esp_timer_get_time() >= state->deadline_us)) {
        state->timed_out = true;
        state->completed = true;
    }
}

static bool i2s_write_start(JSContext *ctx,
                            esp32_mquickjs_runtime_t *runtime,
                            esp32_mquickjs_future_token_t token,
                            esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_i2s_slot_t *slot =
        state != NULL ? i2s_get_slot(&state->channel_ref) : NULL;

    if (state == NULL || slot == NULL || !slot->running) {
        JS_ThrowReferenceError(ctx,
                               "I2S channel closed before write started");
        return false;
    }
    if (slot->tx_busy) {
        JS_ThrowInternalError(ctx,
                              "I2S channel already has a pending write");
        return false;
    }
    slot->tx_busy = true;
    slot->tx_cancel_requested = false;
    slot->tx_runtime = runtime;
    slot->tx_token = token;
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (state->timeout_ms > 0) {
        esp_timer_create_args_t args = {
            .callback = i2s_timeout_timer,
            .arg = state,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "mqjs_i2s_tx",
            .skip_unhandled_events = true,
        };

        state->deadline_us = (uint64_t)esp_timer_get_time() +
                             (uint64_t)state->timeout_ms * 1000ULL;
        if (esp_timer_create(&args, &state->timeout_timer) != ESP_OK ||
            esp_timer_start_once(state->timeout_timer,
                                 (uint64_t)state->timeout_ms * 1000ULL) !=
                ESP_OK) {
            JS_ThrowInternalError(ctx, "failed to start I2S write timeout");
            return false;
        }
    }
    i2s_write_step(state);
    (void)esp32_mquickjs_future_wake(runtime, token);
    return true;
}

static esp32_mquickjs_future_poll_t i2s_write_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    i2s_write_step(state);
    return state != NULL && state->completed
               ? ESP32_MQUICKJS_FUTURE_READY
               : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue i2s_write_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);

    if (state == NULL || state->cancelled) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_ThrowInternalError(ctx, "I2S write cancelled");
    }
    if (state->timed_out) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_ThrowInternalError(
            ctx, "I2SChannel.write() timed out after %u bytes",
            (unsigned)state->transferred_bytes);
    }
    if (state->err != ESP_OK) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_ThrowInternalError(ctx, "I2SChannel.write() failed: %s",
                                     esp_err_to_name(state->err));
    }
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "frames", JS_NewUint32(ctx, state->frame_count)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "byteLength",
            JS_NewInt64(ctx, (int64_t)state->transferred_bytes)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "timestampUs",
            JS_NewInt64(ctx, (int64_t)esp_timer_get_time()))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

static bool i2s_write_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->completed || state->cancelled) {
        return false;
    }
    state->cancelled = true;
    state->completed = true;
    if (state->runtime != NULL) {
        (void)esp32_mquickjs_future_wake(state->runtime, state->token);
    }
    return true;
}

static void i2s_write_destroy(
    esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_i2s_slot_t *slot =
        state != NULL ? i2s_get_slot(&state->channel_ref) : NULL;

    if (state == NULL) {
        return;
    }
    if (state->timeout_timer != NULL) {
        (void)esp_timer_stop(state->timeout_timer);
        (void)esp_timer_delete(state->timeout_timer);
    }
    if (slot != NULL && state->started) {
        slot->tx_busy = false;
        slot->tx_cancel_requested = false;
        slot->tx_runtime = NULL;
        if (slot->release_pending) {
            i2s_cleanup_slot(slot);
        }
    }
    if (state->owner_retained) {
        JS_DeleteGCRef(state->ctx, &state->owner_ref);
    }
    heap_caps_free(state->data);
    heap_caps_free(state);
}

