99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/i2s/esp32_mquickjs_i2s.c
static const esp32_mquickjs_future_driver_t s_i2s_write_driver = {
    .prepare = i2s_write_prepare,
    .start = i2s_write_start,
    .poll = i2s_write_poll,
    .finish = i2s_write_finish,
    .cancel = i2s_write_cancel,
    .destroy = i2s_write_destroy,
};

static bool i2s_register_future_driver(JSContext *ctx,
                                       esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef object_ref;
    JSGCRef method_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    bool result;

    *object = JS_NewObjectClassUser(ctx, JS_CLASS_I2S_CHANNEL);
    *method = JS_IsException(*object) ? JS_EXCEPTION
                                      : JS_GetPropertyStr(ctx, *object, "read");
    result = !JS_IsException(*method) &&
             esp32_mquickjs_future_register_driver(ctx, runtime, *method,
                                                    &s_i2s_read_driver);
    if (result) {
        *method = JS_GetPropertyStr(ctx, *object, "write");
        result = !JS_IsException(*method) &&
                 esp32_mquickjs_future_register_driver(
                     ctx, runtime, *method, &s_i2s_write_driver);
    }
    if (!result && !JS_IsException(*object)) {
        JS_ThrowInternalError(ctx, "failed to register I2S Future driver");
    }
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &object_ref);
    return result;
}

bool esp32_mquickjs_init_i2s_runtime(JSContext *ctx,
                                     esp32_mquickjs_runtime_t *runtime)
{
    int i;

    for (i = 0; i < I2S_LL_GET(INST_NUM); ++i) {
        if (s_i2s_slots[i].allocated && !i2s_slot_busy(&s_i2s_slots[i])) {
            i2s_cleanup_slot(&s_i2s_slots[i]);
        }
        memset(&s_i2s_slots[i], 0, sizeof(s_i2s_slots[i]));
        s_i2s_slots[i].port = i;
    }
    return i2s_register_future_driver(ctx, runtime);
}

void esp32_mquickjs_deinit_i2s_runtime(void)
{
    int i;

    for (i = 0; i < I2S_LL_GET(INST_NUM); ++i) {
        if (s_i2s_slots[i].allocated) {
            i2s_request_close(&s_i2s_slots[i]);
        }
    }
}

JSValue js_i2s_channel_constructor(JSContext *ctx, JSValue *this_val,
                                 int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "I2SChannel cannot be constructed directly");
}

void js_i2s_channel_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_i2s_ref_t *ref = opaque;
    esp32_mquickjs_i2s_slot_t *slot = i2s_get_slot(ref);

    (void)ctx;
    if (slot != NULL) {
        i2s_request_close(slot);
    }
    heap_caps_free(ref);
}

JSValue js_i2s_channel_start(JSContext *ctx, JSValue *this_val,
                           int argc, JSValue *argv)
{
    esp32_mquickjs_i2s_slot_t *slot;
    esp_err_t err;

    (void)argc;
    (void)argv;
    if (i2s_ref_from_value(ctx, *this_val, "I2SChannel.start()", NULL,
                           &slot) != 0) {
        return JS_EXCEPTION;
    }
    if (slot->running) {
        return JS_TRUE;
    }
    err = slot->tx_handle != NULL ? i2s_channel_enable(slot->tx_handle)
                                  : ESP_OK;
    if (err == ESP_OK && slot->rx_handle != NULL) {
        err = i2s_channel_enable(slot->rx_handle);
        if (err != ESP_OK && slot->tx_handle != NULL) {
            (void)i2s_channel_disable(slot->tx_handle);
        }
    }
    if (err != ESP_OK) {
        return JS_ThrowInternalError(ctx, "I2SChannel.start() failed: %s",
                                     esp_err_to_name(err));
    }
    slot->running = true;
    return JS_TRUE;
}

JSValue js_i2s_channel_stop(JSContext *ctx, JSValue *this_val,
                          int argc, JSValue *argv)
{
    esp32_mquickjs_i2s_slot_t *slot;
    esp_err_t err;

    (void)argc;
    (void)argv;
    if (i2s_ref_from_value(ctx, *this_val, "I2SChannel.stop()", NULL,
                           &slot) != 0) {
        return JS_EXCEPTION;
    }
    if (!slot->running) {
        return JS_TRUE;
    }
    if (i2s_slot_busy(slot)) {
        return JS_ThrowInternalError(ctx,
                                     "I2SChannel.stop() refused while I/O is pending");
    }
    err = slot->rx_handle != NULL ? i2s_channel_disable(slot->rx_handle)
                                  : ESP_OK;
    if (slot->tx_handle != NULL) {
        esp_err_t tx_err = i2s_channel_disable(slot->tx_handle);
        if (err == ESP_OK) {
            err = tx_err;
        }
    }
    if (err != ESP_OK) {
        return JS_ThrowInternalError(ctx, "I2SChannel.stop() failed: %s",
                                     esp_err_to_name(err));
    }
    slot->running = false;
    return JS_TRUE;
}

JSValue js_i2s_channel_read(JSContext *ctx, JSValue *this_val,
                          int argc, JSValue *argv)
{
    JSGCRef method_ref;
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *method = JS_GetPropertyStr(ctx, *this_val, "read");
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *this_val, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    return result;
}

JSValue js_i2s_channel_write(JSContext *ctx, JSValue *this_val,
                             int argc, JSValue *argv)
{
    JSGCRef method_ref;
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    *method = JS_GetPropertyStr(ctx, *this_val, "write");
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *this_val, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    return result;
}

JSValue js_i2s_channel_status(JSContext *ctx, JSValue *this_val,
                            int argc, JSValue *argv)
{
    esp32_mquickjs_i2s_slot_t *slot;

    (void)argc;
    (void)argv;
    if (i2s_ref_from_value(ctx, *this_val, "I2SChannel.status()", NULL,
                           &slot) != 0) {
        return JS_EXCEPTION;
    }
    return i2s_status_object(ctx, slot);
}

JSValue js_i2s_channel_close(JSContext *ctx, JSValue *this_val,
                           int argc, JSValue *argv)
{
    esp32_mquickjs_i2s_ref_t *ref;
    esp32_mquickjs_i2s_slot_t *slot;

    (void)argc;
    (void)argv;
    if (JS_GetClassID(ctx, *this_val) != JS_CLASS_I2S_CHANNEL) {
        return JS_ThrowTypeError(ctx, "I2SChannel.close() expects an I2SChannel");
    }
    ref = JS_GetOpaque(ctx, *this_val);
    if (ref == NULL) {
        return JS_TRUE;
    }
    JS_SetOpaque(ctx, *this_val, NULL);
    slot = i2s_get_slot(ref);
    if (slot != NULL) {
        i2s_request_close(slot);
    }
    heap_caps_free(ref);
    return JS_TRUE;
}

JSValue js_i2s_capabilities(JSContext *ctx, JSValue *this_val,
                            int argc, JSValue *argv)
{
    JSGCRef result_ref;
    JSGCRef ports_ref;
    JSGCRef bits_ref;
    JSGCRef limits_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *ports = JS_PushGCRef(ctx, &ports_ref);
    JSValue *bits = JS_PushGCRef(ctx, &bits_ref);
    JSValue *limits = JS_PushGCRef(ctx, &limits_ref);
    int i;

    (void)this_val;
    (void)argc;
    (void)argv;
    *result = JS_NewObject(ctx);
    *ports = JS_NewArray(ctx, 0);
    *bits = JS_NewArray(ctx, 0);
    *limits = JS_NewObject(ctx);
    if (JS_IsException(*result) || JS_IsException(*ports) ||
        JS_IsException(*bits) || JS_IsException(*limits)) {
        goto fail;
    }
    for (i = 0; i < I2S_LL_GET(INST_NUM); ++i) {
        if (JS_IsException(JS_SetPropertyUint32(ctx, *ports, (uint32_t)i,
                                                JS_NewInt32(ctx, i)))) {
            goto fail;
        }
    }
    if (JS_IsException(JS_SetPropertyUint32(ctx, *bits, 0,
                                            JS_NewInt32(ctx, 8))) ||
        JS_IsException(JS_SetPropertyUint32(ctx, *bits, 1,
                                            JS_NewInt32(ctx, 16))) ||
        JS_IsException(JS_SetPropertyUint32(ctx, *bits, 2,
                                            JS_NewInt32(ctx, 24))) ||
        JS_IsException(JS_SetPropertyUint32(ctx, *bits, 3,
                                            JS_NewInt32(ctx, 32))) ||
        !esp32_mquickjs_set_property_ref(ctx, limits, "maxDescriptorBytes",
                                         JS_NewUint32(ctx, I2S_DMA_MAX_DESCRIPTOR_BYTES)) ||
        !esp32_mquickjs_set_property_ref(ctx, limits, "maxReadBytes",
                                         JS_NewUint32(ctx, I2S_MAX_READ_BYTES)) ||
        !esp32_mquickjs_set_property_ref(ctx, limits, "maxWriteBytes",
                                         JS_NewUint32(ctx, I2S_MAX_WRITE_BYTES)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "ports", *ports) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "standard", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "standardRx", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "standardTx", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "standardDuplex",
                                         JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "pdm",
#if SOC_I2S_SUPPORTS_PDM_RX && SOC_I2S_SUPPORTS_PDM2PCM
            JS_TRUE) ||
#else
            JS_FALSE) ||
#endif
        !esp32_mquickjs_set_property_ref(ctx, result, "dataBits", *bits) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "limits", *limits)) {
        goto fail;
    }
    *ports = JS_UNDEFINED;
    *bits = JS_UNDEFINED;
    *limits = JS_UNDEFINED;
    JS_PopGCRef(ctx, &limits_ref);
    JS_PopGCRef(ctx, &bits_ref);
    JS_PopGCRef(ctx, &ports_ref);
    return JS_PopGCRef(ctx, &result_ref);

