99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/i2s/esp32_mquickjs_i2s.c
fail:
    JS_PopGCRef(ctx, &limits_ref);
    JS_PopGCRef(ctx, &bits_ref);
    JS_PopGCRef(ctx, &ports_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

static bool i2s_read_u32_property(JSContext *ctx, JSValue object,
                                  const char *name, uint32_t *value)
{
    JSValue property = JS_GetPropertyStr(ctx, object, name);

    return !JS_IsException(property) &&
           (JS_IsUndefined(property) || i2s_to_u32(ctx, property, value));
}

JSValue js_i2s_open(JSContext *ctx, JSValue *this_val, int argc,
                    JSValue *argv)
{
    esp32_mquickjs_i2s_mode_t mode = ESP32_MQUICKJS_I2S_MODE_STANDARD;
    esp32_mquickjs_i2s_direction_t direction =
        ESP32_MQUICKJS_I2S_DIRECTION_RX;
    uint32_t sample_rate = I2S_DEFAULT_SAMPLE_RATE_HZ;
    uint32_t data_bits = 16;
    uint32_t slot_bits = 16;
    uint32_t dma_descriptors = I2S_DEFAULT_DMA_DESCRIPTORS;
    uint32_t dma_frames = I2S_DEFAULT_DMA_FRAMES;
    uint32_t timeout_ms = I2S_DEFAULT_TIMEOUT_MS;
    i2s_slot_mode_t slot_mode = I2S_SLOT_MODE_MONO;
    i2s_std_slot_mask_t slot_mask = I2S_STD_SLOT_LEFT;
    const char *format = "philips";
    int requested_port = I2S_NUM_AUTO;
    int bclk = -1;
    int ws = -1;
    int din = -1;
    int dout = -1;
    int mclk = I2S_GPIO_UNUSED;
    int pdm_clk = esp32_mquickjs_profile_int_or("ESP32QJS_I2S_PDM_CLK", -2);
    int pdm_din = esp32_mquickjs_profile_int_or("ESP32QJS_I2S_PDM_DIN", -2);
    esp32_mquickjs_i2s_slot_t *slot = NULL;
    i2s_chan_config_t channel_config =
        I2S_CHANNEL_DEFAULT_CONFIG(I2S_NUM_AUTO, I2S_ROLE_MASTER);
    i2s_event_callbacks_t callbacks = {
        .on_recv = i2s_on_receive,
        .on_recv_q_ovf = i2s_on_overflow,
        .on_sent = i2s_on_sent,
        .on_send_q_ovf = i2s_on_send_overflow,
    };
    esp_err_t err;
    JSValue result;
    int i;

    (void)this_val;
    if (argc != 1 || JS_GetClassID(ctx, argv[0]) < 0 ||
        JS_IsArray(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx, "i2s.open(options) expects an options object");
    }
    {
        JSGCRef property_ref;
        JSGCRef pins_ref;
        JSGCRef dma_ref;
        JSValue *property = JS_PushGCRef(ctx, &property_ref);
        JSValue *pins = JS_PushGCRef(ctx, &pins_ref);
        JSValue *dma = JS_PushGCRef(ctx, &dma_ref);
        JSCStringBuf text_buf;
        const char *text;

        *property = JS_GetPropertyStr(ctx, argv[0], "direction");
        if (JS_IsException(*property)) {
            goto parse_fail;
        }
        if (i2s_string_equals(ctx, *property, "rx")) {
            direction = ESP32_MQUICKJS_I2S_DIRECTION_RX;
        } else if (i2s_string_equals(ctx, *property, "tx")) {
            direction = ESP32_MQUICKJS_I2S_DIRECTION_TX;
        } else if (i2s_string_equals(ctx, *property, "duplex")) {
            direction = ESP32_MQUICKJS_I2S_DIRECTION_DUPLEX;
        } else {
            JS_ThrowTypeError(
                ctx,
                "i2s.open({ direction }) expects \"rx\", \"tx\", or \"duplex\"");
            goto parse_fail;
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "mode");
        if (JS_IsException(*property) || !JS_IsString(ctx, *property)) {
            JS_ThrowTypeError(ctx, "i2s.open({ mode }) expects \"standard\" or \"pdm\"");
            goto parse_fail;
        }
        text = JS_ToCString(ctx, *property, &text_buf);
        if (text == NULL) {
            goto parse_fail;
        }
        if (strcmp(text, "pdm") == 0) {
            mode = ESP32_MQUICKJS_I2S_MODE_PDM;
        } else if (strcmp(text, "standard") != 0) {
            JS_ThrowTypeError(ctx, "i2s.open({ mode }) expects \"standard\" or \"pdm\"");
            goto parse_fail;
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "port");
        if (JS_IsException(*property)) {
            goto parse_fail;
        }
        if (!JS_IsUndefined(*property) && !i2s_string_equals(ctx, *property, "auto")) {
            uint32_t parsed_port;

            if (!i2s_to_u32(ctx, *property, &parsed_port) ||
                parsed_port >= I2S_LL_GET(INST_NUM)) {
                JS_ThrowTypeError(ctx, "i2s.open({ port }) expects \"auto\" or a valid port");
                goto parse_fail;
            }
            requested_port = (int)parsed_port;
        }
        if (!i2s_read_u32_property(ctx, argv[0], "sampleRateHz", &sample_rate) ||
            !i2s_read_u32_property(ctx, argv[0], "timeoutMs", &timeout_ms) ||
            sample_rate < 8000 || sample_rate > 192000) {
            JS_ThrowRangeError(ctx, "i2s.open() received an invalid sample rate or timeout");
            goto parse_fail;
        }
        *pins = JS_GetPropertyStr(ctx, argv[0], "pins");
        *dma = JS_GetPropertyStr(ctx, argv[0], "dma");
        if (JS_IsException(*pins) || JS_IsException(*dma) ||
            ((!JS_IsUndefined(*pins) && !JS_IsNull(*pins)) &&
             (JS_GetClassID(ctx, *pins) < 0 || JS_IsArray(ctx, *pins))) ||
            (mode == ESP32_MQUICKJS_I2S_MODE_STANDARD &&
             (JS_IsUndefined(*pins) || JS_IsNull(*pins)))) {
            JS_ThrowTypeError(
                ctx,
                "i2s.open() expects standard pins or a PDM hardware profile");
            goto parse_fail;
        }
        if (!JS_IsUndefined(*dma) &&
            (JS_GetClassID(ctx, *dma) < 0 || JS_IsArray(ctx, *dma))) {
            JS_ThrowTypeError(ctx, "i2s.open({ dma }) expects an object");
            goto parse_fail;
        }
        if (!JS_IsUndefined(*dma) &&
            (!i2s_read_u32_property(ctx, *dma, "descriptorCount", &dma_descriptors) ||
             !i2s_read_u32_property(ctx, *dma, "framesPerDescriptor", &dma_frames))) {
            JS_ThrowTypeError(ctx, "i2s.open({ dma }) expects integer fields");
            goto parse_fail;
        }
        if (mode == ESP32_MQUICKJS_I2S_MODE_PDM) {
            static const char *const standard_only[] = {
                "dataBits", "slotBits", "slotMode", "slotMask", "format",
            };
            size_t option_index;

