99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/i2s/esp32_mquickjs_i2s.c
            for (option_index = 0;
                 option_index < sizeof(standard_only) /
                                    sizeof(standard_only[0]);
                 ++option_index) {
                *property = JS_GetPropertyStr(ctx, argv[0],
                                              standard_only[option_index]);
                if (JS_IsException(*property)) {
                    goto parse_fail;
                }
                if (!JS_IsUndefined(*property)) {
                    JS_ThrowTypeError(
                        ctx, "i2s.open(pdm) does not accept standard-I2S option %s",
                        standard_only[option_index]);
                    goto parse_fail;
                }
            }
            if (!JS_IsUndefined(*pins) && !JS_IsNull(*pins)) {
                *property = JS_GetPropertyStr(ctx, *pins, "clk");
                if (JS_IsException(*property) ||
                    (!JS_IsUndefined(*property) &&
                     !i2s_to_gpio(ctx, *property, true, &pdm_clk))) {
                    JS_ThrowTypeError(ctx, "i2s.open({ pins.clk }) expects an output GPIO");
                    goto parse_fail;
                }
                *property = JS_GetPropertyStr(ctx, *pins, "din");
                if (JS_IsException(*property) ||
                    (!JS_IsUndefined(*property) &&
                     !i2s_to_gpio(ctx, *property, false, &pdm_din))) {
                    JS_ThrowTypeError(ctx, "i2s.open({ pins.din }) expects an input GPIO");
                    goto parse_fail;
                }
            }
        } else {
            if (!i2s_read_u32_property(ctx, argv[0], "dataBits", &data_bits) ||
                !i2s_read_u32_property(ctx, argv[0], "slotBits", &slot_bits)) {
                JS_ThrowTypeError(ctx, "i2s.open() expects integer dataBits/slotBits");
                goto parse_fail;
            }
            *property = JS_GetPropertyStr(ctx, argv[0], "slotMode");
            if (JS_IsException(*property)) {
                goto parse_fail;
            }
            if (!JS_IsUndefined(*property)) {
                if (i2s_string_equals(ctx, *property, "mono")) {
                    slot_mode = I2S_SLOT_MODE_MONO;
                } else if (i2s_string_equals(ctx, *property, "stereo")) {
                    slot_mode = I2S_SLOT_MODE_STEREO;
                } else {
                    JS_ThrowTypeError(ctx, "i2s.open({ slotMode }) expects \"mono\" or \"stereo\"");
                    goto parse_fail;
                }
            }
            *property = JS_GetPropertyStr(ctx, argv[0], "slotMask");
            if (JS_IsException(*property)) {
                goto parse_fail;
            }
            if (!JS_IsUndefined(*property)) {
                if (i2s_string_equals(ctx, *property, "left")) {
                    slot_mask = I2S_STD_SLOT_LEFT;
                } else if (i2s_string_equals(ctx, *property, "right")) {
                    slot_mask = I2S_STD_SLOT_RIGHT;
                } else if (i2s_string_equals(ctx, *property, "both")) {
                    slot_mask = I2S_STD_SLOT_BOTH;
                } else {
                    JS_ThrowTypeError(ctx, "i2s.open({ slotMask }) expects left/right/both");
                    goto parse_fail;
                }
            }
            *property = JS_GetPropertyStr(ctx, argv[0], "format");
            if (JS_IsException(*property)) {
                goto parse_fail;
            }
            if (!JS_IsUndefined(*property)) {
                text = JS_ToCString(ctx, *property, &text_buf);
                if (text == NULL ||
                    (strcmp(text, "philips") != 0 && strcmp(text, "msb") != 0 &&
                     strcmp(text, "pcmShort") != 0 && strcmp(text, "pcmLong") != 0)) {
                    JS_ThrowTypeError(ctx, "i2s.open({ format }) received an unsupported format");
                    goto parse_fail;
                }
                format = strcmp(text, "msb") == 0 ? "msb" :
                         strcmp(text, "pcmShort") == 0 ? "pcmShort" :
                         strcmp(text, "pcmLong") == 0 ? "pcmLong" : "philips";
            }
#define READ_STD_PIN(name, target, output) do { \
    *property = JS_GetPropertyStr(ctx, *pins, name); \
    if (JS_IsException(*property) || !i2s_to_gpio(ctx, *property, output, target)) { \
        JS_ThrowTypeError(ctx, "i2s.open({ pins.%s }) expects a valid GPIO", name); \
        goto parse_fail; \
    } \
} while (0)
            READ_STD_PIN("bclk", &bclk, true);
            READ_STD_PIN("ws", &ws, true);
            if ((direction & ESP32_MQUICKJS_I2S_DIRECTION_RX) != 0) {
                READ_STD_PIN("din", &din, false);
            }
            if ((direction & ESP32_MQUICKJS_I2S_DIRECTION_TX) != 0) {
                READ_STD_PIN("dout", &dout, true);
            }
#undef READ_STD_PIN
            *property = JS_GetPropertyStr(ctx, *pins, "mclk");
            if (JS_IsException(*property) ||
                (!JS_IsUndefined(*property) &&
                 !i2s_to_gpio(ctx, *property, true, &mclk))) {
                JS_ThrowTypeError(ctx, "i2s.open({ pins.mclk }) expects an output GPIO");
                goto parse_fail;
            }
        }
        JS_PopGCRef(ctx, &dma_ref);
        JS_PopGCRef(ctx, &pins_ref);
        JS_PopGCRef(ctx, &property_ref);
        goto parsed;

parse_fail:
        JS_PopGCRef(ctx, &dma_ref);
        JS_PopGCRef(ctx, &pins_ref);
        JS_PopGCRef(ctx, &property_ref);
        return JS_EXCEPTION;
    }

parsed:
    if (mode == ESP32_MQUICKJS_I2S_MODE_PDM) {
        if (direction != ESP32_MQUICKJS_I2S_DIRECTION_RX) {
            return JS_ThrowTypeError(
                ctx, "i2s.open(pdm) only accepts direction \"rx\"");
        }
        if (pdm_clk >= 0 && pdm_clk == pdm_din) {
            return JS_ThrowRangeError(
                ctx, "i2s.open(pdm) requires distinct clk and din GPIOs");
        }
#if !(SOC_I2S_SUPPORTS_PDM_RX && SOC_I2S_SUPPORTS_PDM2PCM)
        return JS_ThrowInternalError(ctx,
                                     "PDM-to-PCM receive is unavailable on this target");
#else
        data_bits = 16;
        slot_bits = 16;
        slot_mode = I2S_SLOT_MODE_MONO;
        if (pdm_clk < 0 || pdm_din < 0) {
            return JS_ThrowTypeError(ctx,
                                     "i2s.open(pdm) requires pins.clk and pins.din or a hardware profile");
        }
        if (requested_port != I2S_NUM_AUTO && requested_port != I2S_NUM_0) {
            return JS_ThrowRangeError(ctx, "PDM RX is available only on I2S port 0");
        }
#endif
    } else {
        if (!((data_bits == 8 || data_bits == 16 || data_bits == 24 ||
               data_bits == 32) &&
              (slot_bits == 8 || slot_bits == 16 || slot_bits == 24 ||
               slot_bits == 32) && data_bits <= slot_bits)) {
            return JS_ThrowRangeError(
                ctx,
                "standard I2S dataBits/slotBits must be 8, 16, 24, or 32 with dataBits <= slotBits");
        }
        if (bclk == ws || (din >= 0 && (bclk == din || ws == din)) ||
            (dout >= 0 &&
             (bclk == dout || ws == dout || dout == din)) ||
            (mclk != I2S_GPIO_UNUSED &&
             (mclk == bclk || mclk == ws || mclk == din ||
              mclk == dout))) {
            return JS_ThrowRangeError(
                ctx, "i2s.open(standard) requires distinct GPIOs");
        }
    }
    if (dma_descriptors < 2 || dma_descriptors > 16 || dma_frames == 0 ||
        dma_frames > I2S_DMA_MAX_DESCRIPTOR_BYTES /
                         (((size_t)slot_bits / 8U) *
                          (slot_mode == I2S_SLOT_MODE_MONO ? 1U : 2U))) {
        return JS_ThrowRangeError(ctx,
                                  "i2s.open({ dma }) exceeds the 4092-byte descriptor limit");
    }
    if (mode == ESP32_MQUICKJS_I2S_MODE_PDM) {
        requested_port = I2S_NUM_0;
    }
    if (requested_port == I2S_NUM_AUTO) {
        for (i = 0; i < I2S_LL_GET(INST_NUM); ++i) {
            if (!s_i2s_slots[i].allocated &&
                esp32_mquickjs_peripheral_lease_acquire(
                    ESP32_MQUICKJS_PERIPHERAL_I2S_PORT, i,
                    ESP32_MQUICKJS_PERIPHERAL_OWNER_I2S,
                    &s_i2s_slots[i].lease)) {
                slot = &s_i2s_slots[i];
                break;
            }
        }
    } else if (!s_i2s_slots[requested_port].allocated &&
               esp32_mquickjs_peripheral_lease_acquire(
                   ESP32_MQUICKJS_PERIPHERAL_I2S_PORT, requested_port,
                   ESP32_MQUICKJS_PERIPHERAL_OWNER_I2S,
                   &s_i2s_slots[requested_port].lease)) {
        slot = &s_i2s_slots[requested_port];
    }
    if (slot == NULL) {
        return JS_ThrowInternalError(ctx, "i2s.open() found no available I2S port");
    }
    slot->allocated = true;
    slot->generation = i2s_take_generation();
    slot->mode = mode;
    slot->direction = direction;
    slot->sample_rate_hz = sample_rate;
    slot->data_bits = (uint8_t)data_bits;
    slot->slot_bits = (uint8_t)slot_bits;
    slot->channels = slot_mode == I2S_SLOT_MODE_MONO ? 1 : 2;
    slot->dma_descriptor_count = dma_descriptors;
    slot->dma_frames_per_descriptor = dma_frames;
    slot->timeout_ms = timeout_ms;
    channel_config.id = slot->port;
    channel_config.dma_desc_num = dma_descriptors;
    channel_config.dma_frame_num = dma_frames;
    err = i2s_new_channel(
        &channel_config,
        (direction & ESP32_MQUICKJS_I2S_DIRECTION_TX) != 0
            ? &slot->tx_handle
            : NULL,
        (direction & ESP32_MQUICKJS_I2S_DIRECTION_RX) != 0
            ? &slot->rx_handle
            : NULL);
    if (err != ESP_OK) {
        i2s_cleanup_slot(slot);
        return JS_ThrowInternalError(ctx, "i2s.open() failed to allocate channel: %s",
                                     esp_err_to_name(err));
    }
    if (mode == ESP32_MQUICKJS_I2S_MODE_STANDARD) {
        i2s_std_config_t config = {
            .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(sample_rate),
            .slot_cfg = I2S_STD_PHILIPS_SLOT_DEFAULT_CONFIG(
                (i2s_data_bit_width_t)data_bits, slot_mode),
            .gpio_cfg = {
                .mclk = (gpio_num_t)mclk,
                .bclk = (gpio_num_t)bclk,
                .ws = (gpio_num_t)ws,
                .dout = dout >= 0 ? (gpio_num_t)dout : I2S_GPIO_UNUSED,
                .din = din >= 0 ? (gpio_num_t)din : I2S_GPIO_UNUSED,
            },
        };

        if (strcmp(format, "msb") == 0) {
            config.slot_cfg = (i2s_std_slot_config_t)
                I2S_STD_MSB_SLOT_DEFAULT_CONFIG(
                    (i2s_data_bit_width_t)data_bits, slot_mode);
        } else if (strcmp(format, "pcmShort") == 0 ||
                   strcmp(format, "pcmLong") == 0) {
            config.slot_cfg = (i2s_std_slot_config_t)
                I2S_STD_PCM_SLOT_DEFAULT_CONFIG(
                    (i2s_data_bit_width_t)data_bits, slot_mode);
            if (strcmp(format, "pcmLong") == 0) {
                config.slot_cfg.ws_width = slot_bits;
            }
        }
        config.slot_cfg.slot_bit_width = (i2s_slot_bit_width_t)slot_bits;
        config.slot_cfg.slot_mask = slot_mask;
        err = slot->tx_handle != NULL
                  ? i2s_channel_init_std_mode(slot->tx_handle, &config)
                  : ESP_OK;
        if (err == ESP_OK && slot->rx_handle != NULL) {
            err = i2s_channel_init_std_mode(slot->rx_handle, &config);
        }
    } else {
#if SOC_I2S_SUPPORTS_PDM_RX && SOC_I2S_SUPPORTS_PDM2PCM
        i2s_pdm_rx_config_t config = {
            .clk_cfg = I2S_PDM_RX_CLK_DEFAULT_CONFIG(sample_rate),
            .slot_cfg = I2S_PDM_RX_SLOT_PCM_FMT_DEFAULT_CONFIG(
                I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO),
            .gpio_cfg = {
                .clk = (gpio_num_t)pdm_clk,
                .din = (gpio_num_t)pdm_din,
            },
        };
        err = i2s_channel_init_pdm_rx_mode(slot->rx_handle, &config);
#else
        err = ESP_ERR_NOT_SUPPORTED;
#endif
    }
    if (err == ESP_OK && slot->rx_handle != NULL) {
        err = i2s_channel_register_event_callback(slot->rx_handle,
                                                  &callbacks, slot);
    }
    if (err == ESP_OK && slot->tx_handle != NULL) {
        err = i2s_channel_register_event_callback(slot->tx_handle,
                                                  &callbacks, slot);
    }
    if (err != ESP_OK) {
        i2s_cleanup_slot(slot);
        return JS_ThrowInternalError(ctx, "i2s.open() failed to initialize channel: %s",
                                     esp_err_to_name(err));
    }
    result = i2s_make_channel(ctx, slot);
    if (JS_IsException(result)) {
        i2s_cleanup_slot(slot);
    }
    return result;
}

#endif
